---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalSystemType
source: html/d775d0f1-19fe-f8cc-0b90-5fe7e860e624.htm
---
# MechanicalSystemType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.